[{"body": "Nudeln mit Blumenkohl nach palermitaner Art\n\nINGREDIENTI\n\n320gr preferibilmente di bucatini oppure pasta corta\n1 cavolfiore piccolo(broccolo)\n1 cipolla\n50gr di pinoli\n50gr di uvetta\n100 gr di pangrattato\n10 acciughe sott'olio\n1 bustina di zafferano\nolio extravergine d'oliva, sale e pepe q.b.ricotta salata q.b.\n\nProcedimento:\n\nLessate il cavolfiore intero in acqua salata, scolatelo tenendo da parte l'acqua di cottura (servirà per la pasta). In una padella mettete i pinoli e fateli imbrunire appena, aggiungete olio abbondante, la cipolla finemente tritata e le acciughe sgocciolate. Quando la cipolla sarà ben appassita aggiungete mezzo mestolo di acqua di cottura del cavolfiore e lo zafferano. Quando il brodo sarà evaporato aggiungente il cavolfiore e un paio di mestoli di brodo di cavolfiore. Aggiustate di sale e pepe e fate cuocere. In una padella versate il pangrattato (fate la \"muddica atturrata\", ovvero pangrattato abbrustolito). Bisogna cuocerla mescolando di continuo finché non prende un bel colore giallo paglierino. A cottura ultimata va immediatamente tolta dalla padella. Nel brodo di cottura del cavolfiore lessate la pasta al dente. Preparate una pirofila, ungetela con olio per bene quindi foderatela con della \"muddica atturrata\". Quando la pasta sarà cotta, scolatela e unitela al composto, quindi riponetela nella pirofila. Coprite con la rimanente \"muddica atturrata\" e passate nel forno rovente per pochi minuti...impiattate spolverate con la ricotta salata buon appetito RICETTA( http://andreamatranga.blogspot.com/)\n", "title": "PASTA COL CAVOLFIORE ALLA PALERMITANA"}, {"body": "*     Quatschakueche en Centre Alsace\n*     Zwatschgawaaje en Haute Alsace\n\nPflaumentarte / Pflaumentorte / Zwetschgenkuchen / Zwetschgentarte \n\nDepuis plus de 20 ans, Wittisheim fait honneur à la plus célèbre des tartes aux fruits alsacienne, en organisant le 2ème dimanche de septembre, la fête de la tarte aux quetsches. Plus de 800 tartes sont confectionnées dans la nuit de samedi à dimanche par des membres d’associations avec l’aide et le savoir faire de nos deux boulangers.\n \nPréparation : 30 minutes            Cuisson : 30 minutes\n\nIngrédients :                          \n \n- 250 grs de farine\n- 125grs de beurre\n- 1 œuf\n- 1,5 cl d’eau\n- 3 cuillerées à soupe de sucre en poudre\n- 1 pointe de sel\n- 1,2 kg de quetsches\n- 1 cuillerée à café de cannelle\n \nCreuser un puits dans la farine tamisée. Y casser l’œuf, verser l’eau, le sel et 1 cuillerée à soupe de sucre. Travailler avec une partie de la farine. Ajouter le beurre coupé en petits morceaux. Bien pétrir le tout. Laisser reposer au frais 30 minutes ou plus (cette pâte peut déjà être préparée la veille). Dénoyauter les quetsches en quarts et découper la limite supérieur en dent de scie. Abaisser la pâte. Foncer un moule à tarte beurré. Piquer le fond avec une fourchette. Placer les quetsches presque debout en cercles concentriques sur la pâte. Enfournez la tarte dans un four à 190°, thermostat 7 et faites la cuire pendant 30 à 40 minutes. Démouler la tarte sur une grille, saupoudrez-la de sucre et de cannelle.\n \nSuggestions :   La tarte peut se servir légèrement tiède.\nVotre maison sentira bon, si vous laisser refroidir la tarte à la fin de la cuisson, four éteint porte du four ouverte \nVin d’accompagnement : un verre de Gewurtztraminer\n", "title": "La tarte aux qutesches de Wittisheim"}, {"body": "Ingredients\n\n\t3 to 4 small potatoes\n\n\t1 can chickpeas\n\n\t1 can crushed tomatoes\n\n\t1 small onion or 2 shallots\n\n\t2 to 3 cloves garlic\n\n\tgaram masala\n\n\tcurry powder\n\n\tcayenne pepper\n\n\tsalt\n\n\n\tBoil the potatoes for about 10 minutes, or until soft.\n\tMeanwhile, heat up a pot with some oil and fry the onion and garlic until softened. Add about two tablespoons of garam masala, a tablespoon of curry powder, and cayenne pepper and salt to taste. Add approximately 1/3 of the can of crushed tomatoes to the spices and simmer while the potatoes are finishing. (These are measurements are approximate, as I sort of made this up as I went along. Feel free to add more of the curry and garam masala if you don't think it's spicy enough!)\n\n\tDrain potatoes and add them, along with the chickpeas, to the tomato mixture. (You can mash the potatoes up first if you like.) Add water as necessary to achieve a tomato gravy consistency.\n\tAllow this to simmer together for a while to allow the spices to marinate more fully, say 20 minutes. Add water as necessary to maintain the consistency.\n\tServe over basmati rice or as is, and enjoy!\n", "title": "Potato & Chickpea Tomato Curry"}, {"body": "Yield 4 servings\nTime 30 minutes, plus chilling\n\nIngredients\n\n1 pound peas in the shell, snow peas or sugar snap peas (frozen are acceptable)\n3 cups chicken or vegetable stock\nSalt and freshly ground black pepper\nSour cream for garnish\nChopped parsley for garnish\nMethod\n\n1. In a saucepan, combine peas and stock, and bring to a boil over medium-high heat. Reduce heat to a simmer, and cook until peas are bright green and tender, 10 minutes or so. Cool a few minutes. If you are using regular peas, remove some from their shells for garnish. (Refrigerate those until serving.)\n2. Pour the cooked peas into a blender, and carefully blend them until they are puréed. Add salt and pepper to taste, and force through a fairly fine strainer, discarding solids. Refrigerate until cool; serve garnished with a dollop of sour cream and the parsley.\nSource: The New York Times\n", "title": "Cold Pea Soup"}, {"body": "Zutaten für 2 Portionen:\n600 g Schweineschnitzel\n2 m.-große Zwiebel(n)\n2 EL Öl(Erdnussöl)\n175 g Erdnusscreme\n1 Prise Pfeffer, schwarzer\n1 Prise Cayennepfeffer\n1 Prise Salz\n1 kl. Dose/n Tomate(n)\n300 ml Fleischbrühe\n1 Bund Petersilie, glatte\n3 Zitrone(n), in Scheiben\n1 EL Kreuzkümmel, gemahlener\n\n\nZubereitung:\nDie Zwiebeln schälen und fein hacken. Das Schweinefleisch in schmale Streifenschneiden. Das Erdnussöl in einer Pfanne erhitzen. Das Fleisch portionsweise darin anbraten und beiseite stellen. Die Zwiebeln im verbliebenen Öl hellbraun anbraten. Die Erdnusscreme untermischen und mit Salz, Pfeffer, Kreuzkümmel und Cayennepfeffer kräftig abschmecken. Die Tomaten mit dem Saft dazugeben. Die Fleischbrühe angiessen und aufkochen. Das Fleisch wieder in den Topf geben und alles zugedeckt bei mittlerer Hitze 40 Minuten köcheln lassen. Inzwischen die Petersillie waschen, einige Zweige zum Garnieren beiseite legen, von den restlichen die Blättchen abzupfen und fein hacken. Das Ragout abschmecken und bei Bedarf nachwürzen. Die Petersillie untermischen. Mit der restlichen Petersille und den Zitronenchnitzen garnieren. Mit Naturreis servieren. \n\nZubereitungszeit: 1 Std. 10 Min.\n", "title": "Afrikanischer Erdnusstopf"}, {"body": "1 cup chickpea flour \n1 teaspoon salt \n1 teaspoon, at least, ground black pepper \n4 to 6 tablespoons olive oil \n½ large onion, thinly sliced, optional \n1 tablespoon fresh rosemary leaves, optional.\n\n1. Heat oven to 450 degrees. Put a well-seasoned or nonstick 12-inch pizza pan or cast-iron skillet in oven. Sift chickpea flour into a bowl; add salt and pepper; then slowly add 1 cup lukewarm water, whisking to eliminate lumps. Stir in 2 tablespoons olive oil. Cover, and let sit while oven heats, or as long as 12 hours. Batter should be about the consistency of heavy cream.\n\n2. If using onion and rosemary, stir them into batter. Pour 2 tablespoons oil into heated pan, and swirl to cover pan evenly. Pour in batter, and bake 12 to 15 minutes, or until pancake is firm and edges set. Heat broiler, and brush top of socca with 1 or 2 tablespoons of oil if it looks dry.\n\n3. Set socca a few inches away from broiler for a few minutes, just long enough to brown it spottily. Cut it into wedges, and serve hot, or at least warm.\n\nYield: 4 to 6 appetizer servings\n", "title": "Socca (Farinata)"}, {"body": "Time: About 45 minutes (Bittman)\n\n2 tablespoons olive oil\n4 skinless chicken thighs\n1 large onion, chopped\n1 tablespoon minced garlic\n1 teaspoon minced fresh ginger\n1 1/2 teaspoons ground coriander\n1 tablespoon ground cumin\n1 1/2 teaspoons ground cinnamon\n1/2 cup chopped dried apricots\n1 cup chopped tomato (fresh or canned or boxed, with juice)\n2 cups cooked or canned chickpeas, drained, with the liquid reserved\n1 to 2 cups chicken stock, bean liquid or water, or more as needed\n1/2 cup bulgur\nSalt and freshly ground black pepper\n1/2 cup chopped fresh parsley, for garnish.\n\n1. Put oil in a large, deep pot over medium-high heat. When oil is shimmering, add chicken and brown well on both sides; remove from pan and set aside. Reduce heat to medium, add onion to the pan and cook until soft, about 5 minutes; add garlic, ginger, coriander, cumin, cinnamon, dried apricots and tomato. Cook and stir just long enough to loosen any brown bits from bottom of pan.\n\n2. Add chickpeas and 1 cup of stock or bean liquid to the pan and turn heat back to medium-high. When mixture reaches a gentle bubble, return chicken to the pan. Cover pot, turn heat to low and cook, checking occasionally to make sure the mixture is bubbling gently, for about 15 minutes or until tomatoes break down and flavors begin to meld. Stir in bulgur, adding more stock if necessary so that the mixture is covered with about an inch of liquid. Season with salt and pepper.\n\n3. Cover and cook until the chicken and bulgur are both done, about 10 to 15 minutes. Taste, adjust the seasonings and serve in bowls garnished with parsley.\n\nYield: 4 servings.\n", "title": "Chickpea Tagine With Chicken and Apricots"}, {"body": "Yield 4 servings\nTime 1 to 1 1/2 hours\n\nUse dark-meat chicken here, and be aware that tagines are on the dry side, so don't add liquid to the sauce unless it is threatening to burn. Home-cooked chickpeas and fresh tomatoes are, of course, preferable to canned varieties, but in this dish the differences are not marked. Do, however, use a vanilla bean, not vanilla extract. Serve with couscous.\nIngredients\n2 tablespoons corn or canola oil\n2 tablespoons butter\n1 large onion, peeled and thinly sliced\n2 cloves garlic, minced\nSalt\nPinch nutmeg\n1/2 teaspoon ground cinnamon\n1 teaspoon ground ginger\n1 teaspoon ground cumin\n1 teaspoon ground coriander\n1/2 teaspoon ground black pepper\nPinch cayenne\n1 1/2 to 2 cups chopped tomatoes (canned are fine; drain excess liquid)\n4 cups chickpeas (canned are fine; drain and rinse first)\n1/2 cup raisins or chopped pitted dates\n1/2 vanilla bean\n8 chicken thighs, or 4 leg-thigh pieces, cut in two\nChopped cilantro or parsley leaves\nMethod\n1. Put oil and butter in a large skillet or casserole, which can be covered later, and turn heat to medium high. When butter melts, add onion, and cook, stirring occasionally, until it softens, 5 to 10 minutes. Add garlic, a large pinch of salt and spices. Cook, stirring, for about 30 seconds. Add tomatoes, chickpeas, raisins and vanilla, and bring to a boil. (If mixture is very dry, add about 1/2 cup water.) Taste, and add salt as necessary.\n2. Sprinkle chicken pieces with salt, and nestle them into sauce. Cover, and 5 minutes later adjust heat so mixture simmers steadily. Cook until chicken is very tender, 45 minutes to an hour. Taste, and adjust seasoning. Then garnish, and serve.\n", "title": "Chicken and Chickpea Tagine"}, {"body": "(Moors and Christians -- a black bean and rice dish)\n\n1 1/2 cups dried black beans\n1/4 cup olive oil for sautéing\n2 1/2 cups white onion, diced\n2 1/2 cups green peppers, seeded and diced\n4 garlic cloves, crushed and chopped\n3 teaspoons ground cumin\n1 teaspoon oregano\n1 bay leaf\n3 tablespoons white vinegar\n2 tablespoons tomato paste\n2 teaspoons salt\n1/2 teaspoon pepper\n4 1/2 cups chicken stock\n3 cups long-grain white rice\n\nCover the dry beans with about four cups water in a two-quart saucepan. DON’T add any salt yet! Bring to a boil, and boil for three minutes. Remove from the heat and let it stand, covered for one hour.\nDrain and rinse the beans. Add enough water to cover once again and bring to a boil; reduce heat to low, cover and cook until tender, about 40 to 50 minutes. Drain.\n\nRinse the rice with cold water until the water runs clear.\n\nUse a large, eight-quart covered stockpot. Sauté the onion and green pepper in the olive oil until tender. Add the garlic, and sauté another minute or two. Add the tomato paste, black beans, oregano, cumin, bay leaf, and vinegar. Cook for about five minutes, stirring gently.\n\nAdd the chicken stock and the rinsed rice. Bring to a boil, reduce heat to low, cover and cook for about 20-30 minutes -- until the rice is fully cooked.\n\nFinally, adjust the seasonings by adding salt and pepper to taste. Remove the bay leaf. Serve Hot.\n\nFor an added treat: Drizzle some olive oil (don’t be stingy!) over the rice in the pot, and fluff cooked rice gently with a fork.\n\nIf plating the rice as a side dish, drizzle a little olive oil over individual servings and garnish with some parsley or cilantro.\n", "title": "Black beans and rice -- Moros y Cristianos"}, {"body": "Il riso al forno dalle mie parti è uno dei classici piatti pronti che si acquistano nelle rosticcerie, ovviamente questo primo piatto preparato a casa è molto più economico e nutriente, tra l’altro è una ricetta molto semplice in cui possiamo decidere noi il condimento che preferiamo.\n\nIngredienti per il riso al forno (dosi per 4 persone)\n400 gr di riso Carnaroli\nSalsa di pomodoro\n2 uova\n1 cipolla\nOlio\nSale\nProsciutto\nParmigiano\nFontina o Provola\nPepe\n \nPreparazione\n\nSbucciate la cipolla, lavatela con l’acqua calda, così non comincerete a piangere, e fatela a fettine sottili, se avete dei bambini o siete come che non sopporto i pezzettini di cipolla in mezzo alla salsa, frullatela molto finemente. Prendete un tegame o una padella piuttosto capiente e mettete un filo d’olio e il sale, fate scaldare qualche minuto e aggiungete la cipolla, e se volete un po’ di origano e di pepe.\nFate soffriggere per circa 10 minuti, la cipolla deve appena dorarsi e poi aggiungete la salsa di pomodoro e fate cuocere per circa 25 minuti mescolando ogni tanto con un cucchiaio di legno.\n \nAssaggiate la salsa e se occorre aggiungete ½ cucchiaino di zucchero, di solito i bambini adorano la salsa un po’ più dolce. Mettete un pentolino sul fuoco per fare le uova sode. In un’altra pentola mettete dell’acqua salata, portate a bollore e versate il riso e fatelo cuocere seguendo le indicazioni sulla confezione. Quando le uova saranno pronte, sbucciatele e fatele a fettine sottili, io ho usato l’attrezzo apposito, ma con un coltello ben affilato viene bene lo stesso.\n \nScolate il riso e aggiungete la salsa che avete preparato, mettendone un po’ da parte in una ciotolina, mescolate bene e se volete aggiungete 4 cucchiai abbondanti di parmigiano grattugiato.\n \nPreparate le fettine di prosciutto e fate a cubetti la fontina o la provola o qualunque formaggio preferite o avete in casa, purchè sia dal sapore delicato e non eccessivamente stagionato. Prendete una teglia e rivestitela di carta da forno lasciando ai margini un po’ di carta, così sarà molto più semplice estrarre il riso quando sarà pronto, e non rischierete di farlo spezzare. Mettete un po’ di riso e pressatelo bene soprattutto ai bordi, poi mettete uno strato di uova, uno di prosciutto e uno formaggio a cubetti.\n\nCoprite con dell’altro riso e sopra mettete un altro po’ di formaggio a cubetti e tanto parmigiano. Mettete la teglia in forno per 20 – 25 minuti a 180°C, e poi se occorre accendete il grill per qualche minuto per farlo gratinare. Sollevate il risotto afferrandolo dalla carta da forno, mettetelo in un piatto da portata e pian piano sfilate la carta da forno in modo da non farlo spezzare. \n \nTagliatelo a fettine, e servitelo mettendo sopra un po’ della salsa che avete preparato.\n\nhttp://www.buttalapasta.it/articolo/ricette-primi-piatti-riso-al-forno/4956/\n", "title": "Riso al forno"}, {"body": "(Bess Feigenbaum's Cabbage Soup)\n\nTime: 3 hours\n\n2 tablespoons olive oil\n2 tablespoons minced garlic\n1 cup minced or grated onion\n1 cup peeled thinly sliced carrots\n1 28-ounce can plum tomatoes in purée\n1 cup tomato paste\n1/2 cup tomato ketchup\n1/2 cup dark brown sugar\n1 bay leaf\n1/2 cup lemon juice\n3 pounds cabbage (tough outer leaves, core and ribs removed), sliced into 1/4-inch-wide ribbons.\n1/2 cup golden raisins\nFresh ground (preferably medium grind) black pepper\nSour cream, optional.\n1. In a 6-quart pot over medium-low heat, heat olive oil and add garlic. Cover and cook until garlic is tender but not browned, about 2 minutes. Add onion, and sauté until translucent. Add 3 cups water, carrots, tomatoes and purée, tomato paste, ketchup, brown sugar and bay leaf. Simmer at a lively bubble for 10 minutes, then crush whole tomatoes with potato masher or fork. Continue to simmer until carrots are tender, about 10 minutes. Discard bay leaf.\n\n2. Using an immersion blender, or working in batches with a stand blender, process mixture until it is coarse, not puréed. Return sauce to pot and add lemon juice, cabbage ribbons and 3 cups water. Place over medium-high heat and cook at a lively simmer until cabbage is cooked to taste, from al dente to meltingly soft, 1 to 2 hours. Add 3 to 6 cups water, to thin to desired consistency. Ten minutes before serving, stir in raisins and a few twists of black pepper. If desired, garnish each serving with a dollop of sour cream.\n\nYield: 8 servings.\n", "title": "Kohlsuppe"}, {"body": "Serves 6 to 8\nPrep 35 min plus 1 hr chilling\nCook 1 hr plus 1 hr cooling\n\nIngredients \n250g plain flour plus a little extra\nPinch of salt \n150g butter plus an extra knob \n75g icing sugar \n1 egg \n1 egg yolk\n\nFor the filling:\n4 large unwaxed lemons \n5 large eggs \n150g caster sugar \n200ml double cream\nCrème fraîche to serve\n\nMethod\nYou will need a 22cm by 2.5cm deep flan ring. To make the pastry, sift 225g flour into a mixing bowl with the salt. Cut the butter into chunks into the bowl and rub it into the flour until it resembles fine breadcrumbs. Sift the icing sugar over the crumbs. Stir. Lightly whisk the whole egg and egg yolk and add to the crumbs. Quickly work everything together and knead a few times. Dust with a little flour if it seems very sticky. Form into a ball, wrap in clingfilm and chill for 1 hour.\n\nHeat the oven to 180C/gas mark 4. Rub the knob of butter over the inside of the flan ring. Dust with flour, shake out the excess and place on a baking sheet. Dust a work surface with flour and roll out the pastry to make a 28cm circle. Roll up pastry on the rolling pin and place over the prepared flan ring, pressing to neatly line the ring, leaving a 1cm overhang. Drape a sheet of greaseproof paper over the ring and fill with baking beans. Bake for 20 minutes. Separate one of the eggs required for the filling and lightly whisk the egg white with 1 tbsp water. Paint the cooked pastry case with beaten egg white to seal. Plug any holes with leftover pastry. Return to the oven, uncovered, for 5 minutes. Lower heat to 150C/gas mark 2.\n\nTo make the filling, remove the zest from the lemons and chop finely to make about 1 tbsp zest. Juice the lemons through a sieve to make approx 175ml and stir in the zest. Whisk 4 eggs and the reserved egg yolk with 150g caster sugar, continuing until the sugar disappears. Lightly whip the cream and stir it into the eggs. Add the lemon juice and zest.\n\nPour the filling into the pastry case and bake for 45-60 minutes until the tart is just set but still slightly wobbly in the middle. If the top shows signs of browning, lay foil over to protect it. Remove from the oven and leave it to cool and firm up. Just before you remove the ring, use a serrated knife to shave the pastry overhang. Before serving, dust the tart with icing sugar. If liked, place under a grill or use a cook’s blowtorch to caramelise the sugar.\n", "title": "Zitronentarte (Tarte au citron, lemon tart)"}, {"body": "Zubereitungszeit 50 min\nBackzeit 50 min (plus Kühlzeit)\n\nFür 12 Stück\n\nMürbeteig:\n200g Butter (kalt)\nSalz\n100g Zucker\n300g Mehl\n\nWalnussfüllung:\n200ml Schlagsahne\n150g Zucker\n50g Honig\n300g geschälte Walnusskerne\nSalz\n30g Butter\n\nZubereitung:\n\n1. Für den Mürbeteig die Butter in Würfel schneiden. Butter, 2 Prisen Salz und Zucker mit den Knethaken des Handrührers verkneten. Mehl zugeben und zügig vernketen. Zum Schluss mit den Händen zu einem flachen Ziegen formen, in Klarsichtfolie wickeln und 1h kalt stellen.\n\n2. Für die Füllung Sahne, Zucker und Honig aufkochen und bei mittlerer Hitze 5 min kochen lassen. Walnüsse grob hacken. Walnüsse, 1 Prise Salz und Butter zu der Sahnemasse geben und weitere 3 min kochen lassen.\n\n3. Mürbeteig auf einer bemehlten Arbeitsfläche 3-4 mm dick ausrollen und Kreis (10 cm Durchmesser) ausstechen. Vorgang wiederholen, bis 12 Kreise ausgestochen sind. Aus Backpapier 24 Quadrate (à 13x13 cm) ausschneiden. 2 Backpapiere übereinanderlegen, sodass man 8 Ecken sieht, darauf einen Mürbeteigkreis legen und mit dem Papier nach unten sanft in eine Muffinform drücken (siehe unten).\n\n4. Lauwarme Walnussfüllung in den Mübreteigschälchen verteilen und im vorgeheizten Ofen auf der untersten Schiene bei 180°C (Gas 23, Umuft 160°C) 40-50 min backen. Nach ca. 15 min Backzeit die Törtchen mit Alufolie abdecken, in der Form auf einem Kuchengitter abkühlen lassen.\n\nTipp: Die Törtchen halten sich in eine Dose luftdicht verschlossen 3 Wochen.\n", "title": "Engadiner Walnusstörtchen"}, {"body": "1 \t Suppenhuhn\n2 große\t Zwiebel(n)\n3 \t Lorbeerblätter\n500 g\t Reis (Parboiled oder Basmati)\n \t Salz und Pfeffer\n1 Liter\t Hühnerbrühe (in der das Suppenhuhn gegart wurde)\n1 Bund\t Suppengrün\n3 EL\t Öl\n\nZubereitung\n\nDies ist ein Gericht, das meine Mutter immer als Alternative gemacht hat, weil man ja, wenn man Hühnersuppe haben will, auch ein Suppenhuhn kochen muss, und was macht man dann damit? In der slovenischen Küche gibt es kein Hühnerfrikassee. \n\nDas Suppenhuhn mit dem Suppengrün und einer stark angerösteten Zwiebel (die Zwiebel in dicke Scheiben schneiden und in der heißen trockenen Pfanne rösten, bis sie fast schwarz sind, das gibt den besten Geschmack) im Schnellkochtopf ca. 25 Minuten kochen. Die Brühe durchseihen, mit Salz und Pfeffer abschmecken und zur Seite stellen. Das Huhn in vier Teile zerlegen (nur Brust und Keulen, ohne die Rückenpartie). \n\nDie zweite Zwiebel klein hacken und in Öl glasig anbraten. Den Reis und die Lorbeerblätter dazugeben und einige Minuten anbraten, mit Salz und Pfeffer würzen. Dann mit der Hühnerbrühe ablöschen und alles in eine feuerfeste Form geben. Die Hähnchenteile mit der Hautseite nach oben darauf legen und bei 220 Grad braten, bis die Flüssigkeit weg ist und die Hühnerhaut gebräunt ist, das dauert 35-45 Minuten.\n\nDas Tolle an dem Gericht ist der Reis, er schmeckt unvergleichlich. Man kann das Gericht auch mit einem frischen Hähnchen machen, aber dann hat man nicht diese tolle Hühnerbrühe und der Reis wird nicht ganz so gut, allerdings schmeckt das Fleisch zarter.\n", "title": "Suppenhuhn mit Lorbeerreis"}, {"body": "Try this Cornmeal Cranberry And Yogurt Muffins - Bon \n\nServings: 12 Muffins \n\nINGREDIENTS\n1 c Fresh or frozen cranberries\n1 c All purpose flour\n1 c Yellow cornmeal\n2/3 c Sugar\n1 tb Baking powder\n1/2 ts Baking soda\nPinch of salt\n3/4 c Plain nonfat yogurt\n1/2 c Nonfat milk\n1/2 c (1 stick) unsalted butter,\n1 lg Egg\n\nPREPARATION\nPosition rack in center of oven and preheat to 400F. Line twelve 1/3-C muffin cups with paper liners. Coarsely chop cranberries in processor. Set aside. Combine flour and next 5 ingredients in large bowl. Whisk yogurt, milk, butter and egg in medium bowl to blend. Add to dry ingredients; mix just until combined. Fold in cranbenies. Divide batter equally among muffin cups. Bake until golden and tester inserted into center of muffins comes out about 20 minutes. Transfer muffin tin to rack and cool.\n\nBon Appetit/October/94 Scanned & edited by Di Pahl & Posted to MM-Recipes Digest by BobbieB1@aol.com on Sep 5, 1999\n", "title": "CORNMEAL CRANBERRY AND YOGURT MUFFINS"}, {"body": "Bittman\n\nYield 8 servings\nTime About 45 minutes\n\nIf you want cornbread as it used to be, try the old-fashioned cornbread variation, below. The basic version is plenty sweet and rich enough, but you could add even more sugar, another egg, and even more fat. Or you could add bits of cooked bacon, sautéed onions or shallots, chili powder or cumin, chopped chilies or herbs, grated cheese, mashed or puréed beans or fresh, canned or frozen corn -- you may have to adjust the amount of liquid you add.\nIngredients\n4 tablespoons butter, olive oil, lard or bacon drippings\n1 1/2 cups medium-grind cornmeal\n1/2 cup all-purpose flour\n1 1/2 teaspoons baking powder\n1 teaspoon salt\n1/4 to 1/2 cup sugar\n2 eggs\n1 1/4 cups milk, more if needed\nMethod\n1. Preheat oven to 375 degrees. Put fat in a 10-inch cast-iron skillet or in an 8-inch square baking pan. Place pan in oven.\n2. Meanwhile, combine dry ingredients in a bowl. Mix eggs into milk, then stir this mixture into dry ingredients, combining with a few swift strokes. If mixture seems dry, add another tablespoon or two of milk.\n3. When fat and oven are hot, remove skillet or pan from oven, pour batter into it and smooth out top. Return pan to oven. Bake about 30 minutes, until top is lightly browned and sides have pulled away from pan; a toothpick inserted into center will come out clean. Serve hot or warm.\nVariations\nOld-Fashioned Cornbread: Reduce fat to 1 tablespoon, sugar to 1 tablespoon (or none) and eggs to 1. Bake as above.\nLighter Cornbread: Separate eggs. Stir yolks into milk, as above, and beat whites until stiff but not dry, then gently stir them into prepared batter after yolks and milk have been incorporated. Bake as above.\n", "title": "Cornbread"}, {"body": "Ustensiles\n\n- 1 casserole\n- 1 saladier\n- 1 passoire\n- 1 grand plat pour bain marie\n- 1 chalumeau de cuisine\n\nIngrédients\n\n- 6 jaunes d'oeuf\n- 1 bouteille de crème (flacon de 500ml)\n- 50 g de sucre (1/4 cup)\n- 1 gousse de vanille\n- 6 cuillères à soupe de cassonade (sucre roux) pour caraméliser\n\nPréparation:\n\n- Préchauffer le four à 160°\n- Fendre la gousse de vanille \n- Dans une casserole faire chauffer la crème dans laquelle on ajoute les grains de vanille et porter à petite ébullition\n- Dans un saladier mélanger les jaunes et le sucre \n- Dès ébullition de la crème, verser la crème sur le mélange en mélangeant au fouet\n- Filtrer\n- Remplir 6 ramequins que l'on place dans un bain marie\n- Mettre au four 25 mn\n- Laisser refroidir puis mettre au réfrigérateur pendant 4 h\n- Au moment de servir\n- Saupoudrer chaque ramequin de cassonade\n- Caraméliser au chalumeau de cuisine\n\nAttendre 1 mn et servir\n", "title": "Crème Brulée (Creme Brulee)"}, {"body": "Published: October 14, 2008\n\nTime: 15 minutes\n\n2 1/2 cups almond milk\n1/3 cup sugar\nPinch of salt\n1 cup regular or whole wheat couscous\n2 teaspoons grated or minced lemon or orange zest\n1 teaspoon ground cardamom\n1/2 to 1 teaspoon rosewater (optional)\n1 cup sliced or chopped almonds\n1/4 cup shelled pistachios (optional)\n1 cup chopped dried apricots.\n\n1. Bring almond milk, sugar and salt to boil in a pot; add couscous, zest, and cardamom; cover and cook for 1 minute, then turn off heat and let sit for 5 minutes.\n\n2. Fluff couscous with a fork and sprinkle on the rosewater if using. Add nuts and apricots, and gently combine. Serve warm or at room temperature.\n\nYield: 4 servings.\n", "title": "Sweet Almond Milk Couscous"}, {"body": "Time: About 30 minutes\nFrom The Minimalist\n\n1/2 cup peanut oil\n2 tablespoons minced garlic\n2 tablespoons minced ginger\nSalt\n2 cups thinly sliced leeks, white and light green parts only, rinsed and dried\n4 cups day-old cooked rice, preferably jasmine, at room temperature\n4 large eggs\n2 teaspoons sesame oil\n4 teaspoons soy sauce.\n1. In a large skillet, heat 1/4 cup oil over medium heat. Add garlic and ginger and cook, stirring occasionally, until crisp and brown. With a slotted spoon, transfer to paper towels and salt lightly.\n\n2. Reduce heat under skillet to medium-low and add 2 tablespoons oil and leeks. Cook about 10 minutes, stirring occasionally, until very tender but not browned. Season lightly with salt.\n\n3. Raise heat to medium and add rice. Cook, stirring well, until heated through. Season to taste with salt.\n\n4. In a nonstick skillet, fry eggs in remaining oil, sunny-side up, until edges are set but yolk is still runny.\n\n5. Divide rice among four dishes. Top each with an egg and drizzle with 1/2 teaspoon sesame oil and 1 teaspoon soy sauce. Sprinkle crisped garlic and ginger over everything and serve.\n\nYield: 4 servings.\n", "title": "Ginger Fried Rice"}, {"body": "Prep time: 10 minutes\nCook time: 20 minutes\nServes: 4\n\nIngredients:\n\nCooked Rice – 1 cup\nWhole Milk – 2 cups\nSugar – 3 tbsp or to taste\nRaisins – 1 tbsp\nChopped Pistachios – 1 tbsp\nChopped Almonds – 1 tbsp\nPowdered Cardamom – 1/8 tsp\nSaffron – a pinch\n\nMethod:\n\n1. In a heavy bottomed pan, on medium heat, add in the the Milk and the Rice.\n2. Grind the Saffron with a little bit of Sugar and add it to the Milk.\n3. Meanwhile, soak the Raisins in a little bit of water to help puff them up.\n4. Keep stirring the pan and make sure it does not burn at the bottom.\n5. Cook till it is of desired thickness.\n6. Once it reaches the desired thickness, add in the Sugar. Mix well.\n7. Add in the Dry fruits – Raisins (without the water), Pistachios and the Almonds.\n8. Turn off the flame and add in the Powdered Cardamom.\n9. Serve hot or cold.\n\nTips:\n1. If you are making the rice just for the Kheer, over cook the rice just a little.\n2. This is a great recipe if you don’t have a lot of time but alternatively, you can add in raw rice and cook it in the milk and it tastes great. But be very careful and and keep stirring frequently.\n3. If you like a smoother texture of rice in the kheer, just mash it lightly before adding it to the Milk.\n", "title": "Rice Kheer (rice pudding)"}, {"body": "1/3 cup short grain rice, washed and drained\n1 1/2 cup water\n3 cups whole milk\n1 cup half and half cream\n1 cup sugar\n1 tsp vanilla extract\n3 tbsp corn starch, melted in 4 tbsp milk (use from 3 cups milk above)\nPinch of salt\n\nBring 1 1/2 cup of water to a boil, then add the rice and lower the heat. Simmer for about 25 minutes (until a little bit of water is left) with the lid covered in a medium sized pot. Add the cream, milk, vanilla extract, sugar and salt. Then slowly add the dissolved corn starch. Stir constantly with a wooden spoon. Cook over medium heat until you see bubbles on the surface. Turn the heat off after one minute.\n\nPour into 6 small glass bowls with a ladle. Place in the fridge to chill them. Sprinkle some cinnamon on top before serving.\n\n\nTurkish Rice Pudding in the Oven\n(Firinda Sutlac)\n\n\n\nAfter cooking the Turkish Rice Pudding, pour it into individual ovenproof bowls. Set the oven to broil. Arrange the bowls on the oven tray and place on the middle rack. Leave in the oven until the tops become brown.\n\nSprinkle some pistachio or cinnamon on top. Serve hot or chilled.\n", "title": "Turkish Rice Pudding (Sutlac)"}, {"body": "4 längliche Zucchini längs halbieren oder Deckel von 8 kugelförmigen Zucchini abschneiden. Die Zucchini aushölen. Das Fruchtfleisch mit 2 Knoblauchzehen hacken und mit 2 EL Olivenöl weich dünsten. Die Zucchini mit 200g Ricotta, 80g geriebenem Parmesan, 1 Bund gehackter Petersilie und 6 Liebstöckelblättern mischen, abschmecken, in die ausgehöhlten Hälften bzw Kugeln füllen. 1 Toastscheibe im Blitzhacker mit je 2 EL Pinienkernen, geriebenem Käse und 1 EL Olivenöl zerbröseln über die Zucchini verteilen und in einer geölen Form bei 200g Umluft ca 25.-30 Minuten überbacken. (Quelle: Kollumne von Siebeck, Zeit)\n\n\nChole Palak (Chickpeas With Spinach)\n\nChickpeas and spinach is a great combination and a healthy, protein rich dish. Chickpeas immersed with spicy spinach gravy. This dish can be served with roti, naan or any other bread.\n\nRecipe will serve 2 to 4.\n\nIngredients: \n1 15oz can of chickpea (chole, garbanzo) \n3 cups finely chopped spinach (palak) \n2 medium tomatoes \n1/2″piece ginger (adrak) \n1 green chili \n3 tablespoon oil \n1/4 teaspoon asafetida (hing) \n1 teaspoon cumin seed (jeera) \n1 tablespoon coriander powder (dhania) \n1/2 teaspoon turmeric (haldi) \n1/2 teaspoon red pepper adjust to taste \n1/2 teaspoon salt adjust to taste \n1/2 teaspoon garam masala\n\nMethod: \nDrain the liquid out of the chickpeas and rince the chick peas well. \nBlend the tomatoes, green chilies, and ginger to make a puree. \nHeat the oil in a saucepan. Test the heat by adding one cumin seed to the oil; if seed cracks right away oil is ready. \nAdd the asafetida and cumin seeds. \nAfter the cumin seeds crack, add the tomato puree, coriander powder, turmeric, red chili powder and cook for about 4 minutes on medium heat. \nTomato mixture will start leaving the oil and will reduce to about half in quantity. \nAdd spinach, and salt and one half cup of water and let it cook covered for 4 to 5 minutes on medium heat covered. \nAdd the chickpeas and mash them lightly with a spatula so they soften Note: add more water as needed to keep the gravy consistency to your liking, and let it cook on low heat for 7 to 8 minutes. \nAdd the garam masala and let it cook for another minute.\n\ntortilla de patatas\n\nAdapted* from The New Spanish Table\n\nServes 6 to 8 as a tapa, 4 as a light main dish. \n\n3 medium-sized Yukon Gold potatoes (about 1 1/2 pounds), peeled and quartered lengthwise (waxy = festkochend, but not exceedingly so)\nCoarse salt (kosher or sea)\n1 1/4 cups extra-virgin olive oil\n1 small onion, quartered and thinly sliced\n6 large, very fresh eggs, preferably organic\n2 tablespoons chicken stock or broth\n\n1. Using a food processor fitted with the slicing blade, slice the potato quarters thinly crosswise, then pat thoroughly dry with paper towels. Alternately, you can use a mandoline set to 1/8-inch thick. The original recipe then says to rub the potato slices with salt, but for the life of me I could not fathom why I should bother with such a tedious step (I had hundreds of small slices), and simply seasoned the potatoes after I cooked them. \n\n2. Heat the olive oil in a large, heavy skillet over medium-high heat until very hot, about 3 minutes. Reduce the heat to medium-low and add the potatoes in even layers. Cook, stirring occasionally, to prevent the potatoes from sticking and browning, until they are half-cooked, about 7 minutes. Stir in the onion, reduce the heat to low, and cook the potatoes until all of them are soft, about 15 minutes more. Using a slotted spoon, transfer the potatoes and onion to a colander set over a bowl and let them drain thoroughly. Set aside 2 tablespoons of the cooking oil and strain the rest for another use. Season the potatoes with salt. \n\n3. Place the eggs, chicken stock, and a couple of pinches of salt in a large mixing bowl and beat until just scrambled. Gently stir in the potato mixture. Mash and stir the egg mixture gently with a fork to crush the potatoes just a little and mix them up well with the eggs. Let stand for about 10 minutes. \n\n4. Heat 5 teaspoons of the reserved olive oil in a heavy 8-inch skillet, preferably nonstick, over medium-high heat until it is just beginning to smoke. Pour the egg mixture into the skillet and flatten the potatoes with a spatula until the top is fairly even. Reduce the heat to medium-low. Cook, moving and shaking the skillet, running a thin spatula around the edge and sliding it into the middle so that some of the egg runs under for about one minute, then let it cook undisturbed until the top is a little wet but not liquid, 6 to 8 minutes. Run the thin spatula under the tortilla to make sure that no part of the bottom is stuck to the skillet. Top the skillet with a rimless plate slightly larger than the skillet and, using oven mitts, quickly invert the tortilla onto the plate. If the skillet looks dry, add a little more olive oil. Carefully slide the tortilla back into the skillet, uncooked side down. Shake the skillet to straighten the tortilla and push the edges in with the spatula. Reduce the heat to very low and cook the tortilla until a toothpick inserted in the center comes out dry, 3 to 4 minutes. Invert the tortilla again, as before, to cook on the first side for another minute. \n\n5. Invert the tortilla onto a serving plate and pat the top with a paper towel to get rid of excess oil. Let it cool a little, then cut the tortilla into wedges and serve warm or at room temperature. To serve as a tapa, cut the tortilla into squares and serve with toothpicks. \n\n* Even though I am indeed in love with this cookbook, I had to make a few adjustments to the recipe in places where it confounded me: I clarified the thickness of the potato slices, limited the egg-pushing step to one minute (it led to the slightly busted appearance of mine, and made little sense) and cooled the potatoes a bit more than suggested, for fear of cooking the eggs in the bowl, not the pan.\n\nFor such a simple recipe, this can generate the most serious arguments! Nobody believes that a tortilla can be made that rivals their Grandmothers!\nI am not Spanish, but learned my recipe from an 80+ year old Spanish lady. I still can’t get it like she does. She did give some hints, however:\n1) The potatoes are important; they should be fairly (but not excessively), waxy potatoes (something like Desiree or King Edwards in the UK, rather than say a floury Golden Wonder). I do not know the American equivalents. She still says, however, that it is not the same without the Galician crop (probably from her own back garden as she grew up).\n2) Dependng on the potato, salting may be required to remove excess water.\n3) It takes a lot of oil, since the potato/onion mixture needs to boil, as well as fry, in the oil. Most of this oil is recovered and used again. Close covering is also recommended. Do not let either potatoes or onions caramelise, so stirring is important..\n4) Olive oil is all that is required. Extra virgin olive oil is too expensive to fry with. Use that for your salads and dressings, or just dip some fresh bread in it!\n5) It never goes near an oven or grill – it must be turned.\n6) Ratios of potatoes/onions/eggs depend on everything – the size of the potatoes, onions, eggs. Just do it until it looks right; an easier thing to see when you are being shown, admittedly!\n7) Preferably keep one pan for making tortilla, and make two or three rather than try to use a different, larger, pan for parties, etc.\n\nFrom what I was taught, I’d say there is too much potato compared to the onion and eggs in the above recipe (but, as I said, that depends on the size of the onion and eggs), and where (as other people have pointed out) did the stock come from? However, if you enjoy it this way, carry on! That is also the beauty of the dish, it has endless variations.\n\npalak paneer\n\nIngredients:\n1 10 oz package of chopped frozen spinach or 4 cups of fresh finely chopped spinach\n1/3 lb paneer\n2 medium tomatoes, pureed\n1 teaspoon chopped ginger\n1 teaspoon coriander powder (dhania)\n1/2 teaspoon turmeric powder (haldi)\n1/2 teaspoon red chili powder\n1 tablespoon oil\n1/2 teaspoon cumin seed (jeera)\nPinch of asafetida (hing)\n1/2 teaspoon salt, or to taste\n2 tablespoons of whole wheat flour\n1/3 cup heavy cream\n1/2 tomato thinly sliced to garnish\n\nMethod:\nIf using frozen spinach thaw and blend it just for a minute so spinach has a creamy texture but without becoming pasty.\nblend the tomatoes and ginger to make puree.\nMix coriander, turmeric, and red chili with tomato puree and set aside.\nMix whole-wheat flour with heavy cream and set aside.\nCube the paneer in about half inch pieces and deep fry them on medium high heat just for few minutes so paneer become very light gold in color, take paneer out on paper towel so extra oil can be absorbed.\nHeat the oil in a saucepan. Test the heat by adding one cumin seed to the oil; if it cracks right away it is ready.\nAdd hing and cumin seed. After cumin seeds crack, add the tomato puree mixture, and let it cook for a few minutes until the tomato puree is about half in volume.\nAdd the spinach, and let it cook on low medium heat for about 10 minutes covered.\nAdd heavy cream mixture and let this cook another four to five minutes.\nAdd paneer and fold it gently with spinach and let it simmer for a 2-3 minutes. Pot should remain covered until the cooking is finished, otherwise the spinach will splatter. \nTransfer the spinach to a serving dish and spread the tomato slices over the top, and cover the dish so tomato slices get tender with the steam from the spinach.\n\nSuggestion\n\nYou can replace the heavy cream with 1 1/2 cups of milk.\n", "title": "Gefüllte Zucchini"}, {"body": "Ingredients:\n\n1 cup moong dal (with skin)\n2 cup chopped spinach\n1 teaspoon shredded ginger\n1/2 teaspoon turmeric\n11/2 teaspoon salt (adjust to taste)\n4 cups water\n1/4 teaspoon garam masala\n1/2 teaspoon lemon juice (adjust to your taste)\nChaunk (seasoning):\n\n2 tablespoon ghee or clarified butter\n1/2 teaspoon cumin seed (Jeera)\nPinch of asafetida (hing)\n4 whole red chilies\n1/4 teaspoon cayenne pepper\nMethod:\n\nWash dal changing water several times till water becomes clear.\nIn pressure cooker put dal, spinach, ginger, turmeric, salt and water and close the cooker.\nCook over medium high till dal comes to boil.\nNow reduce the heat to medium and let it boil for about seven minutes.\nClose the heat and let the steam escape before you open the pressure cooker.\nAdjust the consistency of dal to your desire taste, adding boiled water as needed and mix it.\nAdd lemon juice, and garam masala.\nChaunk (seasoning):\n\nFor seasoning or chaunk heat the ghee in small saucepan, add cumin seed wait until cumin seed cracks now add asafetida, and whole red chili.\nStir for few seconds and add cayenne pepper close the heat and pour over dal.\n", "title": "Mun dal (Moong dhal)"}, {"body": "Rezept funktioniert gut. Sehr lockere Buchteln.\n\nZutaten für 9 Stück: [eher mehr bei kleineren Buchteln]\nTEIG:\n500 g Mehl\n25 g Hefe\n50 g Zucker\nabgeriebene Schale einer halben Zitrone\n¼ l lauwarme Milch\n1 Ei\n1 Prise Salz\n70 g Butter\n\nFÜLLUNG:\n125 g Pflaumenmus\n100 g Butter zum Bestreichen\netwas Fett zum Einstreichen der Form\nPuderzucker zum Bestäuben\n\nVANILLESOSSE:\nZutaten für 6 Portionen:\n1 Vanilleschote\n1/8 l Schlagobers\n1/4 l Milch\n8 Dotter [halbieren!]\n15 dag Kristallzucker [halbieren! vielleicht sogar noch etwas weniger]\n\nMehl in eine vorgewärmte Schüssel geben. In der Mitte eine Mulde drücken. Hefe hineinbröckeln. 1 Teelöffel Zucker und abgeriebene Zitronenschale dazugeben. Mit etwas Milch zum Vorteig verrühren. 20 Minuten an einem warmen Ort gehen lassen.\nRestliche Milch dazugeben, auch das Ei, Salz, den Zucker und die Butter in Flöckchen. Mit dem Handrührgerät oder dem Holzlöffel alle Zutaten gut kneten. Dann den Teig schlagen, bis er Bläschen wirft und trocken ist. Noch einmal 20-30 Minuten gehen lassen. Der Teig muss sich dabei ungefähr verdoppeln.\n\nDanach den Teig daumendick auf einem bemehlten Brett ausrollen und in ca. 9 cm große Quadrate schneiden. Auf jedes Quadrat 1 Teelöffel Powidl geben und die Teigquadrate zusammenklappen. [Es müssen nicht unbedingt Quadrate sein, und sie können auch kleiner sein.]\n\nRundherum mit zerlassener Butter bestreichen. Dicht nebeneinander in eine gut gefettete, feuerfeste Form setzen. Nochmals 20 Minuten gehen lassen [glaube nicht nötig] und dann in den vorgeheizten Ofen schieben.\n\nBei 200 Grad ca. 30-35 Minuten backen. Aus dem Ofen nehmen und vor dem Servieren mit Puderzucker bestäuben.\n\nVanillesoße:\n\nVanilleschote der Länge nach aufschneiden und das Marka auskratzen. Schlagobers mit Milch, Vanilleschote und Vanillemark aufkochen und zugedeckt ziehen lassen, Vanilleschote entfernen.\n\nInzwischen Dotter mit Zucker schaumig rühren. Die Vanillemilch langsam unter ständigem Rühren dazugeben, bis alles gut vermengt ist.\n\nDie Sauce wieder in den Topf gießen, indem die Vanillemilch erhitzt wurde, und langsam bei geringer Hitze cremig einkochen lassen. Die Sauce darf nicht kochen! (Über Eiswasser kalt rühren und zu der Buchtel lauwarm servieren.)\n", "title": "Buchteln mit Powidl"}, {"body": "2 tablespoons peanut oil\n1 large onion, chopped\n1 cup dried red lentils, washed and picked over\n2 tablespoons minced fresh ginger\n1 tablespoon minced garlic\n1 tablespoon mustard seeds\n2 cloves\n1 teaspoon cracked black pepper\nSalt\n2 tablespoons cold butter (optional)\nChopped fresh cilantro leaves for garnish.\n\n1. Put oil in a skillet over medium high heat; when it is hot, add onion and cook until soft, about 10 minutes; set aside.\n\n2. Meanwhile, combine all remaining ingredients except the salt, butter and cilantro in a saucepan. Add water to cover by about 1 inch, and bring to a boil. Adjust heat so mixture bubbles gently, and cook, stirring occasionally and adding water if necessary, until lentils are tender, 15 to 20 minutes. Sprinkle with salt and more pepper and keep cooking to desired tenderness. Lentils should be saucy but not soupy.\n\n3. Remove cloves from pan and add reserved sautéed onion. Stir in butter if you are using it. Taste and adjust seasoning, then garnish with cilantro and serve.\n\nYield: 4 servings.\n", "title": "Spiced Red Lentil Dal"}, {"body": "Time: About an hour\n\nRelated\nThe Minimalist: Elevating Simple Legumes, Just Enough (January 6, 2010)\n1 1/2 cups dried mung beans, washed and picked over\n2 medium green apples, cored, peeled and chopped\n1 14-ounce can coconut milk\nSalt and freshly ground black pepper\n4 tablespoons butter or vegetable oil\n1/2 cup shredded coconut\n2 tablespoons minced fresh ginger\n2 tablespoons minced garlic\nPinch ground turmeric (optional)\n1/2 cup sliced scallions\n1/2 cup chopped fresh mint leaves\nJuice of 1 lime.\n1. In a large pot, combine beans, apples and coconut milk. Add enough water to cover. Bring to a boil over high heat, then turn heat down to medium-low so mixture bubbles steadily but not violently. Cook, stirring occasionally and adding salt as beans become tender, until beans are quite soft, 45 to 60 minutes; add water as needed to keep everything moist.\n\n2. When liquid has thickened, put butter or vegetable oil in a skillet over medium heat until it melts and is foamy (or shimmering if using oil). Add coconut, ginger and garlic and cook. Stir frequently and adjust heat to prevent burning, until mixture (called a tarka) crisps and turns golden, 5 to 10 minutes.\n\n3. Add turmeric if using it, then stir in scallions, mint and lime juice. Cook for a minute or two more, then stir butter mixture into pot of beans. Taste, adjust seasoning and serve.\n\nYield: 4 to 6 servings.\n", "title": "Mung Bean Dal With Apples and Coconut Tarka"}, {"body": "1 cup dried brown lentils, washed and picked over\n\n2 1/2 cups water, coconut milk or vegetable stock, more if needed\n\n4 tablespoons butter or vegetable oil\n\n1 cup chopped scallions\n\n1 tablespoon lemon zest\n\n1 tablespoon curry powder\n\nSalt and freshly ground black pepper\n\nChopped fresh cilantro leaves.\n\n1. In a medium saucepan, combine lentils and liquid and bring to a boil over medium-high heat. Turn heat down to medium-low so that mixture bubbles gently, cover partly and cook, stirring occasionally, until lentils are just tender, 20 to 30 minutes. Add liquid as necessary to keep them a little soupy.\n\n2. Put butter in a skillet over medium heat until it is melted and foamy (or shimmering if using oil). Add scallions and lemon zest and cook, stirring frequently, until soft and fragrant, 3 to 5 minutes. Stir in the curry powder and cook and stir for another minute or so. Add a large pinch of salt, some pepper and the cilantro leaves. Cook mixture (the tarka) for just another 30 seconds or so, then turn off heat.\n\n3. When lentils are cooked to desired tenderness, stir scallion mixture into the lentils. Dal should be moist but not soupy; if it is not, add more water and heat through. Taste and adjust seasoning and serve.\n\nYield: 4 servings.\n", "title": "Lentils With Curried Tarka"}, {"body": "1 1/2 cups dried navy beans, washed, picked over and soaked if you like\n\n2 or 3 dried Thai chilies (optional)\n\n4 tablespoons butter or vegetable oil\n\n2 tablespoons peeled and minced fresh ginger\n\n1/2 red onion, chopped\n\nSalt and freshly ground black pepper\n\n2 tablespoons poppy seeds\n\n1 cup chopped fresh cilantro.\n\n1. In a medium pot, place beans with chilies, if you are using them, and add enough water to cover by about 1/2 inch. Bring to a boil, then turn heat down to medium-low so mixture bubbles gently. Cook, stirring occasionally, until beans are soft, 35 to 45 minutes; add more water as needed to keep beans from sticking.\n\n2. When beans are just tender, put butter in a skillet over medium heat until it is melted and foamy (or shimmering if using oil). Add ginger and onion and cook, stirring frequently, until soft and golden, about 5 minutes. Sprinkle with lots of salt and pepper, then add poppy seeds, stirring to coat with oil and toast for a minute or so. Add cilantro and cook and stir for just another 30 seconds, then turn off heat.\n\n3. When beans are cooked to desired tenderness, stir in the poppy seed mixture (the tarka). Taste, adjust seasoning and serve.\n\nYield: 4 servings.\n", "title": "Navy Beans With Poppy Seed Tarka"}, {"body": "2 tablespoons butter or peanut oil\n1 large yellow onion, chopped\n1 tablespoon curry powder or garam masala\n1/4 cup tomato paste\n1 cup chopped cashews\n1 cup dried French green (Le Puy) lentils, washed and picked over\nSalt and freshly ground black pepper\n1/2 cup yogurt for garnish\n1/4 cup chopped parsley for garnish.\n1. Put butter in a large pot over medium heat until it is melted and foamy (or shimmering if using oil). Add onion and cook, stirring occasionally, until soft and golden, about 5 minutes. Stir in spice blend and keep stirring for a few seconds, until it becomes fragrant. Add tomato paste and cook, stirring frequently, until it darkens, another couple of minutes.\n\n2. Add cashews and stir to coat them in onion mixture. Cook and stir just long enough for them to warm a bit. Add lentils and enough water to cover by about an inch.\n\n3. Bring to a boil, then turn heat down to medium-low so mixture bubbles gently. Cook, stirring until beans are soft, 20 to 30 minutes; add more water as needed to keep everything moist. When lentils are cooked to desired tenderness and mixture has thickened, stir in some salt and pepper, then taste and adjust seasoning. Serve, garnished with a dollop of yogurt and a little parsley.\n\nYield: 4 to 6 servings.\n", "title": "French Lentils With Cashews"}, {"body": "To shred the cabbage, remove any wilted outer leaves; then cut the cabbage in half, remove the core, and thinly slice.\n\nIngredients\nDRESSING:\n1/2  cup  rice vinegar (unseasoned)\n1/4  cup  sugar\n1  tablespoon  peeled, minced fresh ginger\n1/2  teaspoon  dark sesame oil\n1/2  teaspoon  salt\n1/2  teaspoon  crushed red pepper\n\nSALAD:\n5  cups  shredded Savoy cabbage\n1  cup  matchstick-cut carrots\n1  scallion, cut into 1 1/2-inch julienne pieces\n1  tablespoon  thinly sliced fresh basil leaves\n1  tablespoon  thinly sliced fresh mint leaves\n4  tablespoons  dry-roasted peanuts, chopped\nPreparation\nWhisk together the dressing ingredients until the sugar is dissolved.\n\nIn a large bowl, combine the cabbage, carrots, scallions, basil, and mint. Add the dressing, and toss well to coat. Sprinkle with the peanuts.\n", "title": "Asian-style slaw (cabbage)"}, {"body": "Für 1 Pfanne (ca. 1 - 2 Personen) (Schuhbeck)\n\n60g Mehl\n125ml Milch\n2 Eier (getrennt!)\n60g Zucker\n40g Butter\n\nOptional:\nVanilleschote?\n1 TL abgeriebene Zitronenschale?\n40g braune Butter?\n2-3 El Rumrosinen?\n2 El Mandelblättchen?\n\nMehl mit Milch glattrühren. Eigelb, Vanille, Zitronenschale und Braune Butter unterrühren. Eiweiße mit etwas Salz cremig schlagen, nach und nach die Hälfte des Zuckers einrieseln lassen und zu einem festen Schnee weiterschlagen. Eischnee unterheben.\n\nBackhofengrill einschalten. In ofenfeste Pfanne (24-26cm) 1 Tl Butter bei milder Hitzer zerlassen. Teig in die Pfanne verteilen und die Unterseite etwa 2 Minuten hell bräunen (eher länger!). Abgetropfte Rumrosinen und Mandelblättchen draufstreuen und dabei darauf achten, dass sie mit Teig bedeckt sind. Im Ofengrill auf der untersten Schiene 3 Minuten goldbraun backen\n\nSchließlich mit zwei Gabeln (Holzlöffeln) in Stücke zerreißen. Butter mit dem restliche Zucker hinzufügen und den Kiserschmarren in der Pfanne unter Rühren auf dem Herd bei mittlerer Hitze etwas karamelisieren lassen. Mit Puderzucker bestäuben.\n", "title": "Kaiserschmarrn (Kaiserschmarren)"}, {"body": "Ein aus ge reif tes Spargelrezept\n\nZUTA TEN FÜR 4 PERSONEN\n1 kg wei ßer Spargel\n40 g Schalotten\n150 ml Weißwein\n2 Lor beer blät ter\n2 Zweige Petersilie\n220 g Butter\n4 Eier (M)\nSalz\nWei ßer Pfeffer\n½ Bund Petersilie\n½ Bund Schnittlauch\n150 ml Milch\n180 g Mehl\n2 EL Öl\n8 Schei ben Katenschinken\nZUBE REI TUNG\nSpar gel schä len und in feuchte Tücher gewi­ckelt bei sei te stel len. Scha lot ten fein wür feln, mit Wein, Lor beer und Peter si lie auf ko chen. Die Flüs sig keit auf die Hälfte redu zie ren und durch ein Sieb pas sie ren. 200 g But ter in einem Topf schmel zen, auf ko chen und durch ein fei nes Sieb gie ßen. Die klare But ter beiseitestellen.\n2 Eier tren nen. Eigelb mit der Wein re duk tion in einen Schlag kes sel geben und über einem hei­ßen Was ser bad dick lich cre mig auf schla gen. Die But ter erst tröpf chen weise, dann in dün nem Strahl unter rüh ren, mit Salz und Pfef fer wür zen. Zuge deckt warm stellen.\nFür die Krat zete 2 Eier tren nen. Peter si lie hacken, Schnitt lauch in Röll chen schnei den, mit Eigelb und Milch ver quir len. Mehl zuge ben und mit dem Hand rühr ge rät zu einem glat ten Teig ver rüh ren. 10 Minu ten quel len las sen. Eiweiß von 2 Eiern mit einer Prise Salz steif schla gen und unterheben.\nTeig in eine beschich tete Pfanne mit Öl geben und kurz sto cken las sen. Pfann ku chen im hei­ßen Ofen bei 180 Grad (Gas Stufe 2–3, Umluft nicht emp feh lens wert) 8–10 Minu ten auf der zwei ten Schiene von unten backen. Aus dem Ofen neh men, den Pfann ku chen auf der Arbeits flä che mit zwei Gabeln in Stü cke rei ßen. 20 g But ter in der Pfanne erhit zen und die Krat­zete darin rundum hell braun braten.\nSpar gel in Salz was ser 10–12 Minu ten kochen. Hol lan daise auf rüh ren, mit Schin ken und Krat­zete zum Spar gel servieren.\n", "title": "Spargel mit Sauce Hollandaise und Kratzete"}, {"body": "Ingredients:\n\n1/2 pound lean pork loin chop, cut into thin 1″by 1/4″ strips\n1/8 cup Shao Hsing wine or dry sherry\n1 tablespoon corn starch\n1 pound fresh green beans stringed and rinsed\nboiling water for blanching green beans beans\npeanut oil for stir frying\n2 teaspoons fermented black beans\n4 large cloves garlic, peeled and thinly sliced\n3 scallions, white parts thinly sliced\n1 Thai bird chile, thinly sliced on the diagonal\n1 teaspoon thin soy sauce\n1/2 teaspoon raw sugar\n2 tablespoons chicken broth or stock\n1/2 teaspoon toasted sesame oil\ngreen tops to scallions cut on the diagonal in 1″ lengths\n\nMethod:\n\nToss pork with wine and cornstarch. Marinate while preparing other ingredients, or at least for twenty minutes.\n\nBlanch string beans in boiling water for one or two minutes (maybe a bit more), until tender-crisp and very brilliant green. Drain and rinse with cold water, then pat with paper towels until they are as dry as possible.\n\nLightly crush fermented black beans with the back of a spoon.\n\nHeat wok over high heat; when it smokes, add enough oil to stir fry in. Throw in the fermented black beans, garlic, white part of scallion and chile, and stir fry for one minute, until quite fragrant.\n\nLift meat out of marinade (reserve marinade) and add to wok, flattening it into a single layer on the bottom of wok with the back of a wok shovel. Allow to sit still on the bottom of the wok for one minute to begin browning on one side, then stir fry vigorously. As meat begins to look mostly cooked, add the reserved marinade, soy sauce, sugar and broth.\n", "title": "Pork and String Beans With Fermented Black Beans"}]
